var database=[
`<p>За два с половиной месяца, до создания многопользовательского Старгхоста на джаваскрипте,
<a href="https://www.youtube.com/watch?v=aNP2U4E_9fs" class="close" target="_blank">на стриме ко дню копытного
единства 2021</a>,
я показал офлайн прототип Старгхоста.
Данный прототип я создавал чтобы обучится джаваскрипту, ну и ко дню копытного единства конечно,
что то продемонстрировать. По итогу исходники прототипа я залил на
<a href="https://starghosts.forum2x2.ru/t7p25-topic#96" class="close" target="_blank">форум многопользовательского
Старгхоста</a>, в тот момент, когда узнал, что серваки бесплатной версии, будут остановлены.
То есть прототип я оставил как альтернативу основе, так как исходники многопользовательского
Старгхоста сложнее запустить, да и мне они ещё пригодятся. В Марте 2023 я решил повторить
<a href="https://www.youtube.com/watch?v=YrnUVIdhn4o" class="close" target="_blank">финт ушами</a>,
и точно также как я объединил комьюнити Старгхоста в своей игре, также объединить и комьюнити Шаранавтов.
По сути я рассчитывал заниматься только кодовой частью, а фанаты скинут остальные ассеты, если у кого есть.
На первое время, дабы продемонстрировать рабочую версию без оригинальных ассетов, я решил брать 3д
модельки со Скетчфаба, а в дальнейшим поменять их на оригинальные или на срисованные по оригиналам.
В итоге та аудитория, которой попалась моя ссылка, то ли была недостаточно подкована, то ли было
абсолютно всё равно, но никто из этой аудитории не предоставил ассеты. Следующей ставкой было подначить
аудиторию на ютубера "maxidenis в ШараНавтах", который точно был причастен к 
<a href="https://www.youtube.com/watch?v=pNQcyG7jZyE" class="close" target="_blank">людям связанным с шаранавтрами</a>,
и у которого СТОПРОЦ были 
<a href="https://www.youtube.com/watch?v=3uasW4yUDO8" class="close" target="_blank">ассеты 3д моделек</a>
. Ставочка не сыграла, поскольку аудитории было пофиг,
все просто спрашивали что с игрой, и почему не те модельки. По итогу я ввёл 3х героев и несколько
механик в игру, после чего разработка была остановлена. Однако исходники от игры
<a href="https://github.com/proginvert/moba" class="close" target="_blank">лежат в репозитории</a>
на гитхабе.<br><br>
Ну и продолжая традицию выполнения квоты на открытые исходники моих проджэктов, я выкладываю
тестовый 3д конструктор, не опубликованный нигде ранее.<br><br>
<a href="files/3d constructor.zip" class="close" target="_blank">3d constructor.zip</a><br><br>
Конструктор схож по функционалу с
<a href="https://threejs.org/editor/" class="close" target="_blank">three.js editor</a>
, так как на момент начала разработки
я не знал о существовании эдитора.
<video width="320" height="240" controls>
			<source src="video/3d constructor.mp4" type="video/mp4">
			Your browser does not support the video tag.
			</video><br>
Суть конструктора была той же, что и у
<a href="https://proginvert.github.io/1D-RPG-Constructor/" class="close" target="_blank">1RC</a>
, а то есть упростить разработку игр.
В случае 3д конструктора, я хотел проводить настройку игрового мира прямо в конструкторе,
наблюдая результат в живую, без настройки в коде. Да, функционал этого конструктора был бы ограничен,
но банальную каноновскую физику прикрутить планировалось. В общем, кнопка "добавить бибику" в планах на
момент разработки, была апогеем 3д конструктора. Добавление нпс, транспорта, расстановка зданий,
и последующее сохранение проекта в каком то из форматов, с возможностью загрузки этого формата,
и проигрывания созданной симуляции, и были целью создания 3д конструктора, но тема 3д оказалась
сложноватой для меня, и я ушёл в более простое 1д. Собственно 3д конструктор я скорее делал для себя,
нежели для какой то бизнес модели (в отличии от 1RC, который был создан с целью заработка на нём,
вот и делайте выводы, опен сурс никуда у меня не развивается, в отличие от бизнес проектов).</p>
<span class="message-date">2 Фев 2026, 17:15</span>`,
`<p>После создания нового акка на гите, провёл эксперимент, каждый день делал 4 коммита.
Абсолютно неважно их содержание, были и +пробел, и – пробел, гитхаб при каждой нажатой кнопки "коммит ченджес",
заполнял квадрат активности.</p>
<img src="img/activ1.jpg" alt="img">
<p>И я подумал, а если закрашивать таким образом все квадраты,
то через год у меня будет тёмно зелёный календарь активности ?
Оказалось нет, гитраб усреднял активность, и при превышении 3х недель,
скалировал все четверные коммиты на цвет ниже. </p>
<img src="img/activ2.jpg" alt="img">
<p>А я то думал, делай так 4 раза в день, и можно будет налюбить работодателя...
или для чего там нужен этот календарь?</p>
<span class="message-date">1 Фев 2026, 16:13</span>`,
`<img src="img/рис.jpg" alt="img">
<p>На днях искал музыку для шпигелей КЕК короткометражка,
для вставок в моментах описания параметров доставки груза. Вспомнил несколько мелодий.</p>
<audio controls>
    <source src="sound/int_tr1.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br>
  <audio controls>
    <source src="sound/int_tr2.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br>
  <audio controls>
    <source src="sound/int_tr3.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br>
  <p>Четвёртую мелодию, из мем комплейшн, с азиатским продавцом в красной рубашке, и номером телефона снизу, найти не удалось.</p>
<span class="message-date">30 Янв 2026, 18:16</span>`,
`<p>Недавно поднималась тема владений Тарабарского короля. Логично предположить, раз короля, значит это Тарабарское королевство,
с другой стороны, в Золотом ключике, упоминается Страна дураков, возможно тогда это Страна Тарабария. Я прочитал Золотой ключик в оригинале,
нету ни одного опровержения ни первому, ни второму. У городка, в Тарабарском королевстве тоже нету названия,
нейронка его называет "Тарабарск". А вот город в Стране дураков, называется Город Дураков, дабы читатель не путался.
В фанфике "Вторая тайна золотого ключика" уже писалось не только про Тарабарское королевство, но и про Тарабарское государство,
однако сам городок, опять таки, никак назван не был, ни тот, в котором происходят основная сюжетная линия, ни тот,
в котором была гостиница "Две селёдки", однако городскую свалку назвали "Картонвилем". В этом есть какая то определённая фишка.</p>
<span class="message-date">26 Янв 2026, 19:53</span>`,
`<p>DriveToWeb (https://www.drv.tw/) Усё.</p>
<img src="img/DriveToWeb.jpg" alt="img">
<p>Мне как бы всё равно, но что будет, когда они закроют все бесплатные сервисы. Все мои сайты лежат на моих дисках/флешках,
в бекапах, и закрытие того же гитхаба для меня ничего не изменит, как блог читало 1 рудокоп, так по сути и останется.
Момент танца с бубном присутствует только при деплое сайта клиенту, но тут по сути тоже всё просто. Отсутствие опыта
работы с платными платформами компенсируется кошельком клиента, платящим за все сервисы, которые оказались неподходящими для его сайта.</p>
<span class="message-date">25 Янв 2026, 17:11</span>`,
`<p>Что же вы натворили! Уже нейронка считает что для обхода кросдоменки для статического сайта, нужно запускать программу-сервер…</p>
<img src="img/meme.jpg" alt="img">
<p>Господа-товарищи, у меня (да-да, вы не ослышались) есть логика, если какой-то сайт разрабатывается для статического сервера, то и
разрабатывать его нужно статически, ведь в противном случае при переносе статического проекта, допустим на ноде, при переносе на гитхаб,
нам нужно будет менять пути ко всем сопутствующим файлам сайта (пример client/img/meme.jpg => img/meme.jpg). Бывают и другие ошибки,
которые не возникают в динамическом режиме а проявляются при использовании статического сервера (про rapier js я наверное напишу отдельный пост).
Я состою в фонде по борьбе с кросдоменной политикой, и у меня есть милион способов обмануть CORS, начиная от шифровки файла в формат base64,
заканчивая самым бредовым способом, просто заливая файл на левый домен с ssl протоколом, КАЗАЛОСЬ БЫ ЭТО И ЕСТЬ ИСПОЛЬЗОВАНИЕ ПЕРЕСЕЧЕНИЕ ДОМЕНОВ,
НО CORS НАЧХАТЬ, И НА САЙТЕ github.io БЕЗ ПРОБЛЕММ МОГУТ ОБРАБАТЫВАТСЯ ФАЙЛЫ С ru.imgbb.com (к примеру текстуры для three.js). Мне лично всё равно,
у меня сформировались <a href="https://www.youtube.com/watch?v=Yrt9Q9Rzl_U" class="close" target="_blank">индивидуальные стандарты</a>, но вы же убиваете всё желание новичкам. Инженеры ECMAScript,
остановитесь!</p>
<span class="message-date">24 Янв 2026, 18:11</span>`,
`<img src="img/TuxRacerScreenshot.jpg" alt="img">
<p>А до чего же tux racer эволюционировал.
<a href="https://www.youtube.com/watch?v=omha5zJkAGM" class="close" target="_blank">Уже до версии 1.1</a>,
но с трёхколёсниками пока не ровня.</p>
<span class="message-date">20 Янв 2026, 17:47</span>`,
`<p>Переделал порядок сообщений в блоге (теперь новые сообщения появляются с верху). Сейчас в блоге отображаются
5 последних сообщений, чтобы прогрузить ещё 5, нужно пролистать страницу в самый низ, и так по циклу.
Можно было оставить новые сообщения снизу, однако при прогрузки картинок в блоге, контент под картинками
съезжает в низ, и появляется новое пространство для прокрутки, а если картинок много, то браузер может
"недокрутить" пол страницы. В конце концов текущий вариант проще реализовать, окда?</p>
<span class="message-date">19 Янв 2026, 17:58</span>`,
`<img src="img/brt.png" alt="img">
            <p>Вчера откопал квесты к игре golden keygen (ММО по вселенной Буратино, в место которой я сделал
			Anni di piombo). Почитал, в общем это просто скриндж, что я писал в 2021. Вот ссылочка:<br>
			<a href="files/квесты golden keygen.txt" class="close" target="_blank">квесты golden keygen</a></p>
			<span class="message-date">16 Янв 2026, 7:36</span>`,
`<img src="img/dlc anni di piombo.jpg" alt="img">
            <p>Разработка продолжения Anni di piomba пока стоит на месте. Пока работаю над прудом Тортиллы.
			Нашёл прикольные звуки из игры Рыбное местечко 2: Новая эра. Я её даже проходил на 
			<a href="https://www.youtube.com/watch?v=P1Uo8Dw7Rsg" class="close" target="_blank">стриме</a>,
			но сейчас её уже свернули, однако я нашёл ассеты в 
			<a href="files/ru.drimmi.fishing2.apk" class="close" target="_blank">мобильной версии игры</a>, запускать не пробовал,
			так как там СТОПРОЦ вирусы, а распаковать через 7z можно. Там полно звуков из игры, и из них я составил
			два эмбиента для разных локаций пруда. 
			<img src="img/loc dump3.jpg" alt="img">
			<audio controls>
    <source src="sound/nature3_river1.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br><br>
			<img src="img/loc dump4.jpg" alt="img">
			<audio controls>
    <source src="sound/nature2.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br>
			На самом деле время на разработку игры есть, но сейчас я
			этим заниматься не планирую, если интересно (в чём я сомневаюсь) чем закончилась сюжетная линия,
			то у меня есть <a href="files/сценарий к игре.txt" class="close" target="_blank">сценарий к игре</a>. 
			Сюжетку я дописал давно, и уже начал писать побочные квесты.</p>
			<span class="message-date">15 Янв 2026, 19:34</span>`,
`<p>Сегодня расскажу про не вышедший мувик "кек короткометражка". Видос, а может быть и серия
			видеороликов готовились не скажу точно, но ещё до распада WSM. Основной задумкой был придурковатый
			сюжет и простая рисовка, на тот момент времени, камнем преткновения стал вопрос с озвучкой персонажей,
			но с появлением обилия нейронок, этот вопрос решён. Главным героем является мой персонаж bojik,
			работающий на службу доставки Gabazon, на своём малометражном космическом корабле с бортовым номером fr1k.
			По сюжету bojik влипает в абсурдные истории, финал которых заканчивается ничем. К примеру он попадает в
			космический сектор, который зачищает одна из корпораций от конкурентов, зачистка идёт фронтом,
			как в игре FTL. bojik, с компанией энтузиастов пытается помешать корпорации поработить сектор,
			в какой то момент он понимает, что это без полезно, и просто маскируется под этих корпоратов,
			наблюдая уже картину изнутри, ведь если не можешь победить, то присоединяйся. В следующем ролике
			эта корпорация решает напасть на такую же по размерам. Начинается эпическая подготовка,
			контрразведка ловит шпионов, стягиваются флотилии, и в финальном моменте перед атакой, всем дают
			команду "отбой, мы договорились", и после этого все просто расходятся кто куда. Может быть,
			когда ни будь выйдет несколько тестовых серий.</p>
			<span class="message-date">14 Янв 2026, 17:49</span>`,
`<p>Много раз слышал термин "Вайб кодинг" в контексте генерирования кода через нейронку.
			Вообще слово вайб с английского означает атмосфера или же дух. То есть вайб кодить –
			это буквально кодить на своей волне, не соблюдая парадигмы программирования и правила из
			пыльных учебников Страуструпа или Макконнелла. То есть "Я напишу код так, как мне будет
			удобней" не опираясь на алгоритмы и правила, главное штоб работало.<br><br> Вайб кодинг в контексте
			нейронки буквально опирается на забитые в нейронку парадигмы и правила, и никакой
			атмосфЭрой уже и не пахнет, да и никакого кодинга здесь нет поскольку всё пишет аишечка.
			По этому давайте называть вещи своими именами, генерирование кода: это работа через нейронку,
			а вайб кодинг это хреновое программирование.</p>
			<span class="message-date">13 Янв 2026, 17:51</span>`,
`<p>Лайвхак, как загрузить модельку с Meshy AI, не заплатив ни цента!</p>
            <video width="320" height="240" controls>
			<source src="video/lifehack.mp4" type="video/mp4">
			Your browser does not support the video tag.
			</video>
			<a href="files/model (1).glb" class="close" target="_blank">Руфи.glb</a>
			<span class="message-date">12 Янв 2026, 17:20</span>`,
`<p>Во вселенной Буратино нету магических способностей, ну типо там фаербол, айс бласт или арканшот,
			хоть и "магия" присутствует в виде разговаривающих гуманоидных животных, и оживших кукл.
			Я считаю это своеобразной модой конца 19 века, и начала 20, именно тогда, когда были написаны
			Пиноккио и Золотой ключик. В этих книгах была другая философия, другой посыл "магии",
			и именно эту старую моду я пытаюсь натянуть на игру Anni di piombo, которая в свою очередь
			геймплейно срисована с Murloc RPG, философия которой отсылается к Dungeons & Dragons, на основе
			которой делают все fantasy RPG игры.<br><br>
			Юридически (хотя я за это не шарю) ограниченные права на Буратино принадлежат Союзмультфильму
			(изображения буратино, но не остальные персонажи и мир вселенной (как я понял)),
			хоть и существуют фанфики, за основу которых берут совершенно разные сеттинги,
			к примеру "Аргентумный ключ" взял за основу киберпанк сайфай сеттинг.<br><br>
			Мир Буратино можно назвать мульти вселенной, как в фильмах марвелл, где одни и те же персонажи,
			в разных мирах, имеют сильные отличия, так же как и разные версии одного персонажа могут
			встретится в каком то из миров, попав туда через портал. Миры, это книги, авторы которых
			переносят одних персонажей в другие произведения, и таким образом мульти вселенная увеличивается.<br><br>
			Кто угодно может взять Руфи, Мальвину, Кайфаира, Артемона и Пьеро и создать контент,
			в котором у этих персонажей будут магические способности, однако в моей интерпретации,
			в мире Буратино таких способностей нету, и "портал из другого мира" вряд ли откроется в
			Anni di piombo, но это не мешает в каком то ещё мире открыть портал в Anni di piombo,
			такой парадокс авторских прав и мульти вселенных получается.</p>
			<span class="message-date">11 Янв 2026, 12:56</span>`,
`<p>Пришла идея ещё улучшить конструктор (казалось бы, куда ещё), и заключается она в том,
			чтобы добавить рандомное выпадение доступных пользователю ассетов,
			на подобии того, как в приключениях hearthstone выпадают рандомные карты,
			из которых игрок, в процессе игры, создаёт свою колоду. В данном случае это
			будут уже не ассеты, а скорее заранее настроенные персонажи, локации, юсейджи и т.д.<br><br>
			Как это может выглядеть: При старте пользователю из пула 20 героев выпадает 3, и чтобы продолжить
			он должен выбрать одного из них.</p>
            <img src="img/sample1.jpg" alt="img">
			<p>После этого, точно так же, пользователь должен выбрать начальную локацию.</p>
			<img src="img/sample2.jpg" alt="img">
			<p>То же самое происходит с юсейджами, мобами, предметами и т.д. Возможно новые ассеты,
			такие как локации, будут открываться по мере конструирования, а может быть пользователь
			получит все локации сразу, но с выбранной в начале стилистикой. <br><br>Главный вопрос:
			А зачем это добавлять ? По сути получается уже не полноценный конструктор,
			а урезанная в возможностях игра, похожая на Loop Hero. Переделывать конструктор под игру
			у меня пока в планах нету. А вот такую идею, начеркать в своём бложике, у меня в планах было,
			тем более нужно посмотреть, как будет отображаться длинный пост с медиа элементами.</p>`,
`<p>Сгенерировал свой собственный блог, пока нраица. Да, конечно не Video Development Resource,
			но всё же что то. <br><br>Теперь могу выполнять щитпост не только в видео формате, но ещё и без цензуры и регистраций...</p>
            
			<span class="message-date">09 Янв 2026, 18:38</span>`,
]











































