var database=[
`<img src="img/TuxRacerScreenshot.jpg" alt="img">
`,
`<p>Переделал порядок сообщений в блоге (теперь новые сообщения появляются с верху). Сейчас в блоге отображаются
5 последних сообщений, чтобы прогрузить ещё 5, нужно пролистать страницу в самый низ, и так по циклу.
Можно было оставить новые сообщения снизу, однако при прогрузки картинок в блоге, контент под картинками
съезжает в низ, и появляется новое пространство для прокрутки, а если картинок много, то браузер может
"недокрутить" пол страницы. В конце концов текущий вариант проще реализовать, окда?</p>
<span class="message-date">19 Янв 2026, 17:58</span>`,
`<img src="img/brt.png" alt="img">
            <p>Вчера откопал квесты к игре golden keygen (ММО по вселенной Буратино, в место которой я сделал
			Anni di piombo). Почитал, в общем это просто скриндж, что я писал в 2021. Вот ссылочка:<br>
			<a href="files/квесты golden keygen.txt" class="close" target="_blank">квесты golden keygen</a></p>
			<span class="message-date">16 Янв 2026, 7:36</span>`,
`<img src="img/dlc anni di piombo.jpg" alt="img">
            <p>Разработка продолжения Anni di piomba пока стоит на месте. Пока работаю над прудом Тортиллы.
			Нашёл прикольные звуки из игры Рыбное местечко 2: Новая эра. Я её даже проходил на 
			<a href="https://www.youtube.com/watch?v=P1Uo8Dw7Rsg" class="close" target="_blank">стриме</a>,
			но сейчас её уже свернули, однако я нашёл ассеты в 
			<a href="files/ru.drimmi.fishing2.apk" class="close" target="_blank">мобильной версии игры</a>, запускать не пробовал,
			так как там СТОПРОЦ вирусы, а распаковать через 7z можно. Там полно звуков из игры, и из них я составил
			два эмбиента для разных локаций пруда. 
			<img src="img/loc dump3.jpg" alt="img">
			<audio controls>
    <source src="sound/nature3_river1.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br><br>
			<img src="img/loc dump4.jpg" alt="img">
			<audio controls>
    <source src="sound/nature2.mp3" type="audio/mpeg">
    Тег audio не поддерживается вашим браузером. 
   
  </audio><br>
			На самом деле время на разработку игры есть, но сейчас я
			этим заниматься не планирую, если интересно (в чём я сомневаюсь) чем закончилась сюжетная линия,
			то у меня есть <a href="files/сценарий к игре.txt" class="close" target="_blank">сценарий к игре</a>. 
			Сюжетку я дописал давно, и уже начал писать побочные квесты.</p>
			<span class="message-date">15 Янв 2026, 19:34</span>`,
`<p>Сегодня расскажу про не вышедший мувик "кек короткометражка". Видос, а может быть и серия
			видеороликов готовились не скажу точно, но ещё до распада WSM. Основной задумкой был придурковатый
			сюжет и простая рисовка, на тот момент времени, камнем преткновения стал вопрос с озвучкой персонажей,
			но с появлением обилия нейронок, этот вопрос решён. Главным героем является мой персонаж bojik,
			работающий на службу доставки Gabazon, на своём малометражном космическом корабле с бортовым номером fr1k.
			По сюжету bojik влипает в абсурдные истории, финал которых заканчивается ничем. К примеру он попадает в
			космический сектор, который зачищает одна из корпораций от конкурентов, зачистка идёт фронтом,
			как в игре FTL. bojik, с компанией энтузиастов пытается помешать корпорации поработить сектор,
			в какой то момент он понимает, что это без полезно, и просто маскируется под этих корпоратов,
			наблюдая уже картину изнутри, ведь если не можешь победить, то присоединяйся. В следующем ролике
			эта корпорация решает напасть на такую же по размерам. Начинается эпическая подготовка,
			контрразведка ловит шпионов, стягиваются флотилии, и в финальном моменте перед атакой, всем дают
			команду "отбой, мы договорились", и после этого все просто расходятся кто куда. Может быть,
			когда ни будь выйдет несколько тестовых серий.</p>
			<span class="message-date">14 Янв 2026, 17:49</span>`,
`<p>Много раз слышал термин "Вайб кодинг" в контексте генерирования кода через нейронку.
			Вообще слово вайб с английского означает атмосфера или же дух. То есть вайб кодить –
			это буквально кодить на своей волне, не соблюдая парадигмы программирования и правила из
			пыльных учебников Страуструпа или Макконнелла. То есть "Я напишу код так, как мне будет
			удобней" не опираясь на алгоритмы и правила, главное штоб работало.<br><br> Вайб кодинг в контексте
			нейронки буквально опирается на забитые в нейронку парадигмы и правила, и никакой
			атмосфЭрой уже и не пахнет, да и никакого кодинга здесь нет поскольку всё пишет аишечка.
			По этому давайте называть вещи своими именами, генерирование кода: это работа через нейронку,
			а вайб кодинг это хреновое программирование.</p>
			<span class="message-date">13 Янв 2026, 17:51</span>`,
`<p>Лайвхак, как загрузить модельку с Meshy AI, не заплатив ни цента!</p>
            <video width="320" height="240" controls>
			<source src="video/lifehack.mp4" type="video/mp4">
			Your browser does not support the video tag.
			</video>
			<a href="files/model (1).glb" class="close" target="_blank">Руфи.glb</a>
			<span class="message-date">12 Янв 2026, 17:20</span>`,
`<p>Во вселенной Буратино нету магических способностей, ну типо там фаербол, айс бласт или арканшот,
			хоть и "магия" присутствует в виде разговаривающих гуманоидных животных, и оживших кукл.
			Я считаю это своеобразной модой конца 19 века, и начала 20, именно тогда, когда были написаны
			Пиноккио и Золотой ключик. В этих книгах была другая философия, другой посыл "магии",
			и именно эту старую моду я пытаюсь натянуть на игру Anni di piombo, которая в свою очередь
			геймплейно срисована с Murloc RPG, философия которой отсылается к Dungeons & Dragons, на основе
			которой делают все fantasy RPG игры.<br><br>
			Юридически (хотя я за это не шарю) ограниченные права на Буратино принадлежат Союзмультфильму
			(изображения буратино, но не остальные персонажи и мир вселенной (как я понял)),
			хоть и существуют фанфики, за основу которых берут совершенно разные сеттинги,
			к примеру "Аргентумный ключ" взял за основу киберпанк сайфай сеттинг.<br><br>
			Мир Буратино можно назвать мульти вселенной, как в фильмах марвелл, где одни и те же персонажи,
			в разных мирах, имеют сильные отличия, так же как и разные версии одного персонажа могут
			встретится в каком то из миров, попав туда через портал. Миры, это книги, авторы которых
			переносят одних персонажей в другие произведения, и таким образом мульти вселенная увеличивается.<br><br>
			Кто угодно может взять Руфи, Мальвину, Кайфаира, Артемона и Пьеро и создать контент,
			в котором у этих персонажей будут магические способности, однако в моей интерпретации,
			в мире Буратино таких способностей нету, и "портал из другого мира" вряд ли откроется в
			Anni di piombo, но это не мешает в каком то ещё мире открыть портал в Anni di piombo,
			такой парадокс авторских прав и мульти вселенных получается.</p>
			<span class="message-date">11 Янв 2026, 12:56</span>`,
`<p>Пришла идея ещё улучшить конструктор (казалось бы, куда ещё), и заключается она в том,
			чтобы добавить рандомное выпадение доступных пользователю ассетов,
			на подобии того, как в приключениях hearthstone выпадают рандомные карты,
			из которых игрок, в процессе игры, создаёт свою колоду. В данном случае это
			будут уже не ассеты, а скорее заранее настроенные персонажи, локации, юсейджи и т.д.<br><br>
			Как это может выглядеть: При старте пользователю из пула 20 героев выпадает 3, и чтобы продолжить
			он должен выбрать одного из них.</p>
            <img src="img/sample1.jpg" alt="img">
			<p>После этого, точно так же, пользователь должен выбрать начальную локацию.</p>
			<img src="img/sample2.jpg" alt="img">
			<p>То же самое происходит с юсейджами, мобами, предметами и т.д. Возможно новые ассеты,
			такие как локации, будут открываться по мере конструирования, а может быть пользователь
			получит все локации сразу, но с выбранной в начале стилистикой. <br><br>Главный вопрос:
			А зачем это добавлять ? По сути получается уже не полноценный конструктор,
			а урезанная в возможностях игра, похожая на Loop Hero. Переделывать конструктор под игру
			у меня пока в планах нету. А вот такую идею, начеркать в своём бложике, у меня в планах было,
			тем более нужно посмотреть, как будет отображаться длинный пост с медиа элементами.</p>`,
`<p>Сгенерировал свой собственный блог, пока нраица. Да, конечно не Video Development Resource,
			но всё же что то. <br><br>Теперь могу выполнять щитпост не только в видео формате, но ещё и без цензуры и регистраций...</p>
            
			<span class="message-date">09 Янв 2026, 18:38</span>`,
]






